MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VLQ12/mcu.h
#define GO                            0x80000000      // Initiate Cache Command
#define PUSHW1                        0x08000000      // Push Way 1
#define INVW1                         0x04000000      // Invalidate Way 1
#define PUSHW0                        0x02000000      // Push Way 0
#define INVW0                         0x01000000      // Invalidate Way 0
#define ENWRBUF                       0x00000002      // Enable Write Buffer
#define ENCACHE                       0x00000001      // Cache enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCLCR register.
//
//*****************************************************************************

#define LACC                          0x08000000      // Line access type
#define LADSEL                        0x04000000      // Line Address Select
#define LCMD                          0x06000000      // Line Command
#define LCWAY                         0x00400000      // Line Command Way
#define LCIMB                         0x00200000      // Line Command Initial Modified Bit
#define LCIVB                         0x00100000      // Line Command Initial Valid Bit
#define TDSEL                         0x00010000      // Tag/Data Select
#define WSEL                          0x00004000      // Way select
#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCSAR register.
//
//*****************************************************************************

#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCCVR register.
//
//*****************************************************************************

#define DATA                          0x7FFFFFFF80000000      // Cache read/write Data


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCRMR register.
//
//*****************************************************************************

#define R0                            0x180000000      // Region 0 mode
#define R1                            0x60000000      // Region 1 mode
#define R2                            0x18000000      // Region 2 mode
#define R3                            0x06000000      // Region 3 mode
#define R4                            0x01800000      // Region 4 mode
#define R5                            0x00600000      // Region 5 mode
#define R6                            0x00180000      // Region 6 mode
#define R7                            0x00060000      // Region 7 mode
#define R8                            0x00018000      // Region 8 mode
#define R9                            0x00006000      // Region 9 mode
#define R10                           0x00001800      // Region 10 mode
#define R11                           0x00000600      // Region 11 mode
#define R12                           0x00000180      // Region 12 mode
#define R13                           0x00000060      // Region 13 mode
#define R14                           0x00000018      // Region 14 mode
#define R15                           0x00000006      // Region 15 mode


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_PFAPR register.
//
//*****************************************************************************

#define M7PFD                         0x00800000      // Master 7 Prefetch Disable
#define M6PFD                         0x00400000      // Master 6 Prefetch Disable
#define M5PFD                         0x00200000      // Master 5 Prefetch Disable
#define M4PFD                         0x00100000      // Master 4 Prefetch Disable
#define M3PFD                         0x00080000      // Master 3 Prefetch Disable
#define M2PFD                         0x00040000      // Master 2 Prefetch Disable
#define M1PFD                         0x00020000      // Master 1 Prefetch Disable
#define M0PFD                         0x00010000      // Master 0 Prefetch Disable
#define M7AP[1:0]                     0x00018000      // Master 7 Access Protection
#define M6AP[1:0]                     0x00006000      // Master 6 Access Protection
#define M5AP[1:0]                     0x00001800      // Master 5 Access Protection
#define M4AP[1:0]                     0x00000600      // Master 4 Access Protection
#define M3AP[1:0]                     0x00000180      // Master 3 Access Protection
#define M2AP[1:0]                     0x00000060      // Master 2 Access Protection
#define M1AP[1:0]                     0x00000018      // Master 1 Access Protection
#define M0AP[1:0]                     0x00000006      // Master 0 Access Protection


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_PFB01CR register.
//
//*****************************************************************************

#define B01RWSC[3:0]                  0x780000000      // Bank 0-1 Read Wait State Control
#define CLCK_WAY[3:0]                 0x78000000      // Cache Lock Way x
#define CINV_WAY[3:0]                 0x07800000      // Cache Invalidate Way x
#define S_B_INV                       0x00080000      // Invalidate Prefetch Speculation Buffer
#define B01MW[1:0]                    0x000C0000      // Bank 0-1 Memory Width
#define CRC[2:0]                      0x00000380      // Cache Replacement Control
#define B01DCE                        0x00000010      // Bank 0-1 Data Cache Enable
#define B01ICE                        0x00000008      // Bank 0-1 Instruction Cache Enable
#define B01DPE                        0x00000004      // Bank 0-1 Data Prefetch Enable
#define B01IPE                        0x00000002      // Bank 0-1 Instruction Prefetch Enable
#define B01SEBE                       0x00000001      // Bank 0-1 Single Entry Buffer Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_PFB23CR register.
//
//*****************************************************************************

#define B23RWSC[3:0]                  0x780000000      // Bank 2-3 Read Wait State Control
#define                               0xFF8000000      // 
#define B23MW[1:0]                    0x000C0000      // Bank 2-3 Memory Width
#define                               0x007F8000      // 
#define                               0x00000380      // 
#define B23DCE                        0x00000010      // Bank 2-3 Data Cache Enable
#define B23ICE                        0x00000008      // Bank 2-3 Instruction Cache Enable
#define B23DPE                        0x00000004      // Bank 2-3 Data Prefetch Enable
#define B23IPE                        0x00000002      // Bank 2-3 Instruction Prefetch Enable
#define B23SEBE                       0x00000001      // Bank 2-3 Single Entry Buffer Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW0Sn register.
//
//*****************************************************************************

