MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VLQ12/mcu.h
#define WPON                          0x00000080      // Wakeup Pin On
#define TSIE                          0x00000010      // Time Seconds Interrupt Enable
#define MOIE                          0x00000008      // Monotonic Overflow Interrupt Enable
#define TAIE                          0x00000004      // Time Alarm Interrupt Enable
#define TOIE                          0x00000002      // Time Overflow Interrupt Enable
#define TIIE                          0x00000001      // Time Invalid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TTSR register.
//
//*****************************************************************************

#define TTS                           0x7FFFFFFF80000000      // Tamper Time Seconds


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MER register.
//
//*****************************************************************************

#define MCE                           0x00000010      // Monotonic Counter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MCLR register.
//
//*****************************************************************************

#define MCL                           0x7FFFFFFF80000000      // Monotonic Counter Low


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MCHR register.
//
//*****************************************************************************

#define MCH                           0x7FFFFFFF80000000      // Monotonic Counter High


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_WAR register.
//
//*****************************************************************************

#define MCHW                          0x00000800      // Monotonic Counter High Write
#define MCLW                          0x00000400      // Monotonic Counter Low Write
#define MERW                          0x00000200      // Monotonic Enable Register Write
#define TTSW                          0x00000100      // Tamper Time Seconds Write
#define IERW                          0x00000080      // Interrupt Enable Register Write
#define LRW                           0x00000040      // Lock Register Write
#define SRW                           0x00000020      // Status Register Write
#define CRW                           0x00000010      // Control Register Write
#define TCRW                          0x00000008      // Time Compensation Register Write
#define TARW                          0x00000004      // Time Alarm Register Write
#define TPRW                          0x00000002      // Time Prescaler Register Write
#define TSRW                          0x00000001      // Time Seconds Register Write


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_RAR register.
//
//*****************************************************************************

#define MCHR                          0x00000800      // Monotonic Counter High Read


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_EIR register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This field is reserved.
#define BABR                          0x40000000      // Babbling Receive Error
#define BABT                          0x20000000      // Babbling Transmit Error
#define GRA                           0x10000000      // Graceful Stop Complete
#define TXF                           0x08000000      // Transmit Frame Interrupt
#define TXB                           0x04000000      // Transmit Buffer Interrupt
#define RXF                           0x02000000      // Receive Frame Interrupt
#define RXB                           0x01000000      // Receive Buffer Interrupt
#define MII                           0x00800000      // MII Interrupt.
#define EBERR                         0x00400000      // Ethernet Bus Error
#define LC                            0x00200000      // Late Collision
#define RL                            0x00100000      // Collision Retry Limit
#define UN                            0x00080000      // Transmit FIFO Underrun
#define PLR                           0x00040000      // Payload Receive Error
#define WAKEUP                        0x00020000      // Node Wakeup Request Indication
#define TS_AVAIL                      0x00010000      // Transmit Timestamp Available
#define TS_TIMER                      0x00008000      // Timestamp Timer


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_EIMR register.
//
//*****************************************************************************

#define BABR                          0x40000000      // BABR Interrupt Mask
#define BABT                          0x20000000      // BABT Interrupt Mask
#define GRA                           0x10000000      // GRA Interrupt Mask
#define TXF                           0x08000000      // TXF Interrupt Mask
#define TXB                           0x04000000      // TXB Interrupt Mask
#define RXF                           0x02000000      // RXF Interrupt Mask
#define RXB                           0x01000000      // RXB Interrupt Mask
#define MII                           0x00800000      // MII Interrupt Mask
#define EBERR                         0x00400000      // EBERR Interrupt Mask
#define LC                            0x00200000      // LC Interrupt Mask
#define RL                            0x00100000      // RL Interrupt Mask
#define UN                            0x00080000      // UN Interrupt Mask
#define PLR                           0x00040000      // PLR Interrupt Mask
#define WAKEUP                        0x00020000      // WAKEUP Interrupt Mask
#define TS_AVAIL                      0x00010000      // TS_AVAIL Interrupt Mask
#define TS_TIMER                      0x00008000      // TS_TIMER Interrupt Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RDAR register.
//
//*****************************************************************************

