MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VLQ12/mcu.h
#define RDAR                          0x01000000      // Receive Descriptor Active


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TDAR register.
//
//*****************************************************************************

#define TDAR                          0x01000000      // Transmit Descriptor Active


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ECR register.
//
//*****************************************************************************

#define DBSWP                         0x00000100      // Descriptor Byte Swapping Enable
#define STOPEN                        0x00000080      // STOPEN Signal Control
#define DBGEN                         0x00000040      // Debug Enable
#define EN1588                        0x00000020      // EN1588 Enable
#define SLEEP                         0x00000008      // Sleep Mode Enable
#define MAGICEN                       0x00000004      // Magic Packet Detection Enable
#define ETHEREN                       0x00000002      // Ethernet Enable
#define RESET                         0x00000001      // Ethernet MAC Reset


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MMFR register.
//
//*****************************************************************************

#define OP                            0x60000000      // Operation Code
#define PA                            0xF8000000      // PHY Address
#define RA                            0x07C00000      // Register Address
#define TA                            0x00060000      // Turn Around
#define DATA                          0x7FFF8000      // Management Frame Data


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MSCR register.
//
//*****************************************************************************

#define HOLDTIME                      0x00001C00      // Hold time On MDIO Output
#define DIS_PRE                       0x00000080      // Disable Preamble
#define MII_SPEED                     0x00000FC0      // MII Speed


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MIBC register.
//
//*****************************************************************************

#define MIB_IDLE                      0x40000000      // MIB Idle
#define MIB_CLEAR                     0x20000000      // MIB Clear
#define MIB_DIS                       0x1FFFFFFF0000000      // Disable MIB Logic


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RCR register.
//
//*****************************************************************************

#define GRS                           0x80000000      // Graceful Receive Stopped
#define NLC                           0x40000000      // Payload Length Check Disable
#define MAX_FL                        0x7FFE0000000      // Maximum Frame Length
#define CFEN                          0x00008000      // MAC Control Frame Enable
#define CRCFWD                        0x00004000      // Terminate/Forward Received CRC
#define PAUFWD                        0x00002000      // Terminate/Forward Pause Frames
#define PADEN                         0x00001000      // Enable Frame Padding Remove On Receive
#define RMII_10T                      0x00000200      // Enables 10-Mbps mode of the RMII .
#define RMII_MODE                     0x00000100      // RMII Mode Enable
#define Reserved                      0x00000080      // This field is reserved.
#define Reserved                      0x00000040      // This field is reserved.
#define FCE                           0x00000020      // Flow Control Enable
#define BC_REJ                        0x00000010      // Broadcast Frame Reject
#define PROM                          0x00000008      // Promiscuous Mode
#define MII_MODE                      0x00000004      // Media Independent Interface Mode
#define DRT                           0x00000002      // Disable Receive On Transmit
#define LOOP                          0x00000001      // Internal Loopback


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TCR register.
//
//*****************************************************************************

#define CRCFWD                        0x00000200      // Forward Frame From Application With CRC
#define ADDINS                        0x00000100      // Set MAC Address On Transmit
#define ADDSEL                        0x00000380      // Source MAC Address Select On Transmit
#define RFC_PAUSE                     0x00000010      // Receive Frame Control Pause
#define TFC_PAUSE                     0x00000008      // Transmit Frame Control Pause
#define FDEN                          0x00000004      // Full-Duplex Enable
#define Reserved                      0x00000002      // This field is reserved.
#define GTS                           0x00000001      // Graceful Transmit Stop


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_PALR register.
//
//*****************************************************************************

#define PADDR1                        0x7FFFFFFF80000000      // Pause Address


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_PAUR register.
//
//*****************************************************************************

#define PADDR2                        0x7FFF80000000      // Bytes 4 (bits 31:24) and 5 (bits 23:16) of the 6-byte individual address
#define TYPE                          0x7FFF8000      // Type Field In PAUSE Frames


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_OPD register.
//
//*****************************************************************************

